app/Controllers/Clientes.php

        public function index(){

            $clientes = $this->cliente_model->findAll(); //findAll para recuperar os dados
---
SELECT *
FROM `clientes`