app/Controllers/Funcionarios.php

    public function index(){

      $data["funcionarios"] = $this->funcionario_model->findAll();  // PARA RECUPERAR TODOS OS REGISTROS //
---
SELECT *
FROM `funcionarios`

    public function ver($id_funcionario){

      $data["funcionario"] = $this->funcionario_model
                           ->where("id_funcionario", $id_funcionario)
                           ->first();
---
SELECT *
FROM `funcionarios`
WHERE `id_funcionario` = '20'
 LIMIT 1