app/Controllers/Produtos.php

    public function index() {

      $data["produtos"] = $this->produto_model->findAll();     // PARA VER TODOS OS PRODUTOS
---
SELECT *
FROM `produtos`

    public function editar($id_produto){

      $data["produto"] = $this->produto_model->where("id_produto", $id_produto)
                                             ->first();
---
SELECT *
FROM `produtos`
WHERE `id_produto` = '1'
 LIMIT 1